var gps_position_str;
var debug=true;
if(!debug){
    gps_position_str=window.GPSp.getPositions();
}else{
    gps_position_str='[{"lat":29.174596148987515,"lng":119.4940528462751}, {"lat":29.174578759469316,"lng":119.49406728988566}, {"lat":29.173976508645765,"lng":119.4940527943662}, {"lat":29.173959860309946,"lng":119.49404233274855}, {"lat":29.1739535389055,"lng":119.49403668701875}, {"lat":29.17394084922453,"lng":119.49404116890888}, {"lat":29.17392416042952,"lng":119.49404432218142}, {"lat":29.17391931106254,"lng":119.4940484726574}, {"lat":29.173914465642653,"lng":119.49405129485127}, {"lat":29.173902604997668,"lng":119.49405743716275}, {"lat":29.17390074410992,"lng":119.49406623687551}, {"lat":29.173898045302863,"lng":119.494076364799}, {"lat":29.173907201220086,"lng":119.49408234283402}, {"lat":29.17391034070228,"lng":119.49409230520943}, {"lat":29.173899637744796,"lng":119.49410176831857}, {"lat":29.173908782803714,"lng":119.49411139912445}, {"lat":29.173922761439126,"lng":119.49412219258012}, {"lat":29.173921562787736,"lng":119.49413265269277}, {"lat":29.17392953831022,"lng":119.49414294753755}, {"lat":29.173937837055256,"lng":119.49415672914468}, {"lat":29.173951303457304,"lng":119.4941715073927}, {"lat":29.173962435725663,"lng":119.4941859533726}, {"lat":29.17396206807751,"lng":119.49419740975692}]';
}
var gps_position=JSON.parse(gps_position_str);
// 119.494741,29.178387
// 创建地图实例
var map = new AMap.Map("daily-map-note", {
    zoom: 17,
    center: [119.494741, 29.178387],
    resizeEnable: true
});
var liter_level=5;
for (let i = 0; i < gps_position.length; i+=liter_level) {
    map.add( new AMap.Circle({
        center: new AMap.LngLat(gps_position[i]["lng"],gps_position[i]["lat"]), // 圆心位置
        radius: 1,  //半径
        strokeColor: "#A3BBDB",  //线颜色
        strokeOpacity: 1,  //线透明度
        strokeWeight: 1,  //线粗细度
        fillColor: "#A3BBDB",  //填充颜色
        fillOpacity: 0.35 //填充透明度
    }));
}
map.setFitView();